app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.order(id: :asc)
    @users = @users.page(params[:page]).per(5)

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "test66"], ["password_digest", "$2a$12$I/.IkTrO6OHHD7Im09mcc.Dy.TiUOblAuXd93BCrTrSoDAviGfORO"], ["updated_at", "2022-11-09 14:36:30.795918"], ["id", 1]]
---
  def update
    if @user.update(user_params)