app/views/users/show.html.erb


  <% @user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 15]]