app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if params[:back]
      render :new
    else
      if @task.save
---
INSERT INTO "tasks" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "太郎"], ["content", "朝飯"], ["created_at", "2022-11-02 14:16:49.115913"], ["updated_at", "2022-11-02 14:16:49.115913"]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "三郎太"], ["content", "夜飯なし"], ["updated_at", "2022-10-28 02:55:49.556282"], ["id", 4]]

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]