app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."deadline_on" DESC
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" DESC
SELECT "tasks".* FROM "tasks" WHERE (title LIKE '%太郎%') AND "tasks"."status" = $1  [["status", "2"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks"
---
  def index
    @tasks = current_user.tasks.order(created_at: "DESC")
  if params[:sort_exprired]
    @tasks = current_user.tasks.order(deadline_on: "DESC")
  elsif params[:sort_priority]
    @tasks = current_user.tasks.order(priority: "ASC")
  end
    if params[:task].present?
      title_input = params[:task][:title]
      status_input = params[:task][:status]

      if title_input.present? && status_input.present?
        @tasks = current_user.tasks.title_search(title_input).status_search(status_input)
      elsif title_input.present?
        @tasks = current_user.tasks.title_search(title_input)
      elsif status_input.present?
        @tasks = current_user.tasks.status_search(status_input)
      # if params[:task][:title].present? && params[:task][:status].present?
      #   @tasks = Task.where("title LIKE ?", "%#{params[:task][:title]}%").where(status: status)
      # elsif params[:task][:title].present?
      #   @tasks = Task.where("title LIKE ?", "%#{params[:task][:title]}%")
      # elsif params[:task][:status].present?
      #   @tasks = Task.where(status: status)
      end
    end
    @tasks = @tasks.page(params[:page]).per(5)

INSERT INTO "tasks" ("title", "content", "created_at", "updated_at", "deadline_on", "priority", "status", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @task = current_user.tasks.build(task_params)
    if params[:back]
      render :new
    else
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "priority" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2022-11-09 14:38:25.160397"], ["priority", 1], ["id", 4]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def check_user
    @task = Task.find(params[:id])