app/views/admin/users/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
---

  <% @user.tasks.each do |task| %>